In [13]:
import numpy as np
import pandas as pd
df={'Roll.No':[1,2,3,4,5],'Name':['Anju','Balu','Carl','Dane','Edward'],'Status':['Pass','Fail','Pass','Fail','Fail']}
df=pd.DataFrame(df)
df

   Roll.No    Name Status
0        1    Anju   Pass
1        2    Balu   Fail
2        3    Carl   Pass
3        4    Dane   Fail
4        5  Edward   Fail

In [14]:
encode={'Status':{"Pass":"Fail","Fail":"Pass"}}
encoded1=df.replace(encode)
encoded1

   Roll.No    Name Status
0        1    Anju   Fail
1        2    Balu   Pass
2        3    Carl   Fail
3        4    Dane   Pass
4        5  Edward   Pass

In [15]:
df=encoded1
df['Status'].value_counts()

Pass    3
Fail    2
Name: Status, dtype: int64

In [19]:
df['Status']=df['Status'].astype('category')
df.dtypes

Roll.No       int64
Name         object
Status     category
dtype: object